tkw-dev/PSoC/Workspace01/CY8C4147AZI-S475_128KB_L.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "CapSense_1.h"
#include "CapSense_1_Control.h"
#include "CapSense_1_Filter.h"
#include "CapSense_1_Processing.h"
#include "CapSense_1_Sensing.h"
#include "CapSense_1_Structure.h"
#include "CapSense_1_Tuner.h"
#include "CapSense_1_Configuration.h"
#include "CapSense_1_SensingCSD_LL.h"
#include "CapSense_1_RegisterMap.h"
#include "CapSense_1_Centroid_LL.h"
#include "BATTRead.h"
#include "BATTRead_aliases.h"
#include "SPI_1.h"
#include "SPI_1_SPI_UART.h"
#include "SPI_1_PINS.h"
#include "SPI_1_SPI_UART_PVT.h"
#include "SPI_1_PVT.h"
#include "SPI_1_BOOT.h"
#include "PWM_1.h"
#include "PushSW.h"
#include "PushSW_aliases.h"
#include "Clock_1.h"
#include "IlluminationPWM.h"
#include "IlluminationPWM_aliases.h"
#include "Clock_2.h"
#include "ADC_SAR_Seq_1.h"
#include "UART_3.h"
#include "UART_3_SPI_UART.h"
#include "UART_3_PINS.h"
#include "UART_3_SPI_UART_PVT.h"
#include "UART_3_PVT.h"
#include "UART_3_BOOT.h"
#include "CapSense_1_ISR.h"
#include "SPI_1_sclk_m.h"
#include "SPI_1_sclk_m_aliases.h"
#include "SPI_1_miso_m.h"
#include "SPI_1_miso_m_aliases.h"
#include "SPI_1_mosi_m.h"
#include "SPI_1_mosi_m_aliases.h"
#include "ADC_SAR_Seq_1_IRQ.h"
#include "ADC_SAR_Seq_1_intClock.h"
#include "UART_3_SCBCLK.h"
#include "UART_3_tx.h"
#include "UART_3_tx_aliases.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "core_cm0plus_psoc4.h"
#include "CyDMA.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

